commit-guide.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-01-21 Wed 01:27 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Commit Guide</title>
<meta name="author" content="JohnDevlopment" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Commit Guide</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org60ed890">1. Anatomy of a Commit</a></li>
<li><a href="#orgc86f67e">2. Commit Formats</a>
<ul>
<li><a href="#orga08ed56">2.1. Refactoring A Single Extension</a></li>
<li><a href="#orgde72deb">2.2. Actions Within A Single Extension</a>
<ul>
<li><a href="#org62c6cdd">2.2.1. Scope</a></li>
</ul>
</li>
<li><a href="#orgfe2d55c">2.3. Actions Within A Subextension</a>
<ul>
<li><a href="#org6940d5c">2.3.1. Scope</a></li>
</ul>
</li>
<li><a href="#org4f074b3">2.4. Actions Within A Single Bootstrap</a>
<ul>
<li><a href="#org7ee3f98">2.4.1. Scope</a></li>
</ul>
</li>
<li><a href="#orgcd9e0c6">2.5. Add/Remove/Modify Bootstraps</a></li>
<li><a href="#orgb719719">2.6. Add/Remove/Modify Extensions</a></li>
<li><a href="#org8744560">2.7. Moving Code Into A New Extension</a></li>
<li><a href="#org1681f66">2.8. A Single Action Within Multiple Extensions</a></li>
<li><a href="#org1206087">2.9. Refactoring Multiple Extensions</a></li>
<li><a href="#org26f81ae">2.10. A single action within a so-called packages</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org60ed890" class="outline-2">
<h2 id="org60ed890"><span class="section-number-2">1.</span> Anatomy of a Commit</h2>
<div class="outline-text-2" id="text-1">
<pre class="example" id="org99b041c">
[TAG] SCOPE: MESSAGE

BODY
</pre>

<p>
<i>BODY</i> is optional.
</p>
</div>
</div>

<div id="outline-container-orgc86f67e" class="outline-2">
<h2 id="orgc86f67e"><span class="section-number-2">2.</span> Commit Formats</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orga08ed56" class="outline-3">
<h3 id="orga08ed56"><span class="section-number-3">2.1.</span> Refactoring A Single Extension</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example" id="orge312690">
[REFACTOR] Elisp-ext

* (Sub)section comments
* Advice
* Requires
* elisp-ext-in-comment-p
** Move
** Make inline
* elisp-ext--rx
** Docstring
</pre>
</div>
</div>

<div id="outline-container-orgde72deb" class="outline-3">
<h3 id="orgde72deb"><span class="section-number-3">2.2.</span> Actions Within A Single Extension</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org62c6cdd" class="outline-4">
<h4 id="org62c6cdd"><span class="section-number-4">2.2.1.</span> Scope</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>The name of the extension without the <code>-ext</code> (e.g., <code>sh</code>)
<ul class="org-ul">
<li>Exceptions
<ul class="org-ul">
<li><code>extensions</code>: referred to as <code>main</code></li>
<li>Extensions with no <code>-ext</code> suffix
<ul class="org-ul">
<li><code>errors</code></li>
<li><code>general</code></li>
<li><code>local-lambda</code></li>
</ul></li>
</ul></li>
<li>For <code>polymode-ext</code> in particular, the "subscope" can is the name of a polymode
<ul class="org-ul">
<li>e.g., <code>polymode/sh</code> for Shell script mode</li>
</ul></li>
</ul></li>
<li>For extensions that implement some external feature (such as a minor mode),
append a <code>/X</code>, with <code>X</code> being one of the following:
<ul class="org-ul">
<li>Hs minor mode &#x2014; e.g., <code>sh/hs</code></li>
<li>Skeletons &#x2014; e.g., <code>sh/skeletons</code></li>
<li>Ert tests &#x2014; e.g., <code>pkg:cl/ert</code></li>
</ul></li>
</ul>

<p>
If the subject line would be empty, it may be replaced with the scope, like so:
<code>[REFACTOR] General</code>
</p>
</div>
</div>
</div>

<div id="outline-container-orgfe2d55c" class="outline-3">
<h3 id="orgfe2d55c"><span class="section-number-3">2.3.</span> Actions Within A Subextension</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A subextension, as the name implies, is a file that is superceded by an extension.
An extension would have a name like <code>foo-ext_subext-bar</code>.
</p>
</div>

<div id="outline-container-org6940d5c" class="outline-4">
<h4 id="org6940d5c"><span class="section-number-4">2.3.1.</span> Scope</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>Python
<ul class="org-ul">
<li>Syntax: <code>python/syntax</code></li>
<li>Project: <code>python/project</code></li>
<li>Docstring: <code>python/docstring</code></li>
</ul></li>
</ul>

<pre class="example" id="org7b7948d">
[REFACTOR] Python/Syntax: Rename x-`docstring' to x-`string'
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f074b3" class="outline-3">
<h3 id="org4f074b3"><span class="section-number-3">2.4.</span> Actions Within A Single Bootstrap</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org7ee3f98" class="outline-4">
<h4 id="org7ee3f98"><span class="section-number-4">2.4.1.</span> Scope</h4>
<div class="outline-text-4" id="text-2-4-1">
<ul class="org-ul">
<li>The name of any extension ending in "-bootstrap" (e.g., "jdesktop-bootstrap")</li>
</ul>

<hr>

<pre class="example" id="orga500fd1">
[UPDATE] Jdesktop-bootstrap: Improvements
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd9e0c6" class="outline-3">
<h3 id="orgcd9e0c6"><span class="section-number-3">2.5.</span> Add/Remove/Modify Bootstraps</h3>
<div class="outline-text-3" id="text-2-5">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Tag:</td>
<td class="org-left">update</td>
</tr>

<tr>
<td class="org-left">Scope:</td>
<td class="org-left">main</td>
</tr>

<tr>
<td class="org-left">Subject:</td>
<td class="org-left">Bootstraps</td>
</tr>

<tr>
<td class="org-left">Body:</td>
<td class="org-left"><i>action list</i></td>
</tr>
</tbody>
</table>

<p>
For the <i>action list</i>, each item has the form <code>ACTION: EXTENSION</code>. <i>ACTION</i> is
one of add, change, delete, or move. <i>EXTENSION</i> is the name of the extension
which contains the bootstrap code. <i>EXTENSION</i> refers to an extension whose name
ends in "-bootstrap"; however, <i>EXTENSION</i> itself shall remove that suffix. Case
in point: for an extension called <code>foo-bootstrap</code>, <i>EXTENSION</i> shall be <code>foo</code>.
</p>

<p>
Here is an example of such a commit:
</p>

<pre class="example" id="orge985267">
[UPDATE] Main: Bootstraps

* Add: code-outline
* Change: liquidsoap
</pre>
</div>
</div>

<div id="outline-container-orgb719719" class="outline-3">
<h3 id="orgb719719"><span class="section-number-3">2.6.</span> Add/Remove/Modify Extensions</h3>
<div class="outline-text-3" id="text-2-6">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Tag:</td>
<td class="org-left">update</td>
</tr>

<tr>
<td class="org-left">Scope:</td>
<td class="org-left">main</td>
</tr>

<tr>
<td class="org-left">Subject:</td>
<td class="org-left">Extensions</td>
</tr>

<tr>
<td class="org-left">Body:</td>
<td class="org-left"><i>action list</i></td>
</tr>
</tbody>
</table>

<pre class="example" id="org3a31a82">
[UPDATE] Main: Extensions

* Remove: imenu
</pre>
</div>
</div>

<div id="outline-container-org8744560" class="outline-3">
<h3 id="org8744560"><span class="section-number-3">2.7.</span> Moving Code Into A New Extension</h3>
<div class="outline-text-3" id="text-2-7">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Tag:</td>
<td class="org-left">update</td>
</tr>

<tr>
<td class="org-left">Scope:</td>
<td class="org-left"><i>extension from which code is removed</i></td>
</tr>

<tr>
<td class="org-left">Subject:</td>
<td class="org-left">Move code into <i>extension</i></td>
</tr>

<tr>
<td class="org-left">Body:</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<pre class="example" id="orgbb80abb">
[UPDATE] Desktop: Move code into jdesktop-bootstrap
</pre>
</div>
</div>

<div id="outline-container-org1681f66" class="outline-3">
<h3 id="org1681f66"><span class="section-number-3">2.8.</span> A Single Action Within Multiple Extensions</h3>
<div class="outline-text-3" id="text-2-8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Tag:</td>
<td class="org-left"><i>tag</i></td>
</tr>

<tr>
<td class="org-left">Scope:</td>
<td class="org-left">Multiple</td>
</tr>

<tr>
<td class="org-left">Subject:</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Body:</td>
<td class="org-left"><i>list of extensions</i></td>
</tr>
</tbody>
</table>

<pre class="example" id="org46aeab9">
[REMOVE] Multiple: Documentation

* buffers
* comment-tags
* custom
* dired
* elisp
* extensions
* general
* help
* imenu
* lsp
* rust
</pre>
</div>
</div>

<div id="outline-container-org1206087" class="outline-3">
<h3 id="org1206087"><span class="section-number-3">2.9.</span> Refactoring Multiple Extensions</h3>
<div class="outline-text-3" id="text-2-9">
<pre class="example" id="org6042415">
[REFACTOR] Multiple
</pre>
</div>
</div>

<div id="outline-container-org26f81ae" class="outline-3">
<h3 id="org26f81ae"><span class="section-number-3">2.10.</span> A single action within a so-called packages</h3>
<div class="outline-text-3" id="text-2-10">
<p>
This applies to extensions under <code>packages/</code>.
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Tag:</td>
<td class="org-left"><i>tag</i></td>
</tr>

<tr>
<td class="org-left">Scope:</td>
<td class="org-left">pkg:​<i>extension</i></td>
</tr>

<tr>
<td class="org-left">Subject:</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Body:</td>
<td class="org-left"><i>list of extensions</i></td>
</tr>
</tbody>
</table>

<pre class="example" id="orgeaae1ac">
[UPDATE] Pkg:debug: Improve --ignore

* Add more specific edebug spec
* Show warning when compiled
</pre>

<p>
If the message is empty, the scope may replace it, resulting in this:
</p>

<pre class="example" id="org9cce458">
[REFACTOR] Pkg:cl
</pre>
</div>
</div>
</div>
</div>
<footer id="postamble" class="status">
<p class="author">Author: JohnDevlopment</p>
<p class="date">Created: 2026-01-21 Wed 01:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</footer>
</body>
</html>
